In [ ]:
# 저장, 연산, 출력(사용자의 편의성 고려)
# 출력 : 보기 편하다

In [9]:
import pandas as pd
# 1차원 자료구조 : Series
# Series 생성
pop = pd.Series([9904312,3448737,2890451,2466052])
pop

0    9904312
1    3448737
2    2890451
3    2466052
dtype: int64

In [3]:
# Series : index를 직접 지정할 수 있음
pop = pd.Series([9904312,3448737,2890451,2466052], index = ['서울', '부산', '인천', '대구'])
pop

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [5]:
# 직접 지정한 인덱스를 슬라이싱에 사용하면
# [이상 : 이하] 기존에는 두번째 요소 미만이지만 판다스에서는 이하로 지정된다
pop['서울': '인천']

서울    9904312
부산    3448737
인천    2890451
dtype: int64

In [9]:
# 인덱스를 지정하지 않으면 0부터 시작하는 번호
# 인덱스를 직접 지정하면 해당 값이 인덱스로 반영
pop[1]

3448737

In [6]:
# Series 값 확인 : values 
pop.values

array([9904312, 3448737, 2890451, 2466052], dtype=int64)

In [7]:
# Series 인덱스 확인 : index
pop.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [8]:
# Series 타입 확인 : dtype
pop.dtype

dtype('int64')

In [14]:
# 인덱스에 이름달기 .name
pop.index.name = '도시'
pop

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 도시, dtype: int64

In [15]:
pop.name = '인구'
pop

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [ ]:
# 타입 : int64, int32, int16
# 뒤에 붙은 숫자 :  공간의 크기(컴퓨터가 저장할 수 있는 숫자의 범위)
# 64 = 저장할 수 있는 범위가 -2^63 ~ + 2^63
# 32 = -2^31 + 2^31 = 21억 4천만 ~~~

In [ ]:
# float64, float32, float16
# 0.0000001 != 0.00000002
# 실수는 갯수가 무한정 
# 컴퓨터는 저장공간의 한계가 있음
# 따라서 일정 범위의 실수를 똑같이 계산
# 0.00000001 ~ 0.0000000002는 똑같이 계산
num = 1/9
num ==1/9

In [4]:
# Series 연산
# Series 전체를 대상으로 한번에 연산
pop / 1000000

서울    9.904312
부산    3.448737
인천    2.890451
대구    2.466052
dtype: float64

In [6]:
# 팬시 인덱싱(Fancy Indexing)
# 여러가지 인덱싱 방법이 섞인 인덱싱을 부르는 명칭
# 리스트를 사용해서 인덱싱하기
# 순서, 방향, 횟수 무시할 수 있다. 
pop[['부산','대구', '인천', '부산']]

부산    3448737
대구    2466052
인천    2890451
부산    3448737
dtype: int64

In [7]:
pop[[0,3,3,2,1]]

서울    9904312
대구    2466052
대구    2466052
인천    2890451
부산    3448737
dtype: int64

In [18]:
# 불리언 인덱싱
# 인구수가 250만 이상인 값을 출력
# 인구수가 500만 이하의 값을 출력
# 인수구가 250만 이상 500만 이하의 값 출력

bol1 = pop[:] >= 2500000
print(pop[bol1])

bol2 = pop[:] <= 5000000
print(pop[bol2])

print(pop[bol1 & bol2])
print(pop[(pop>=2500000) & (pop <=5000000)])

서울    9904312
부산    3448737
인천    2890451
dtype: int64
부산    3448737
인천    2890451
대구    2466052
dtype: int64
부산    3448737
인천    2890451
dtype: int64
부산    3448737
인천    2890451
dtype: int64

In [ ]:
# and 부울 연산
# & 여러 대상 한번에 비트 연산

In [20]:
# 딕셔너리로  Series 생성
# key 와 value로 이루어져있음
# index = key값
# value = value 값

{'서울': 9631482, '부산': 3393191, '인천': 2632035, '대전': 1490158}

In [21]:
pop1 = pd.Series(dic)
pop1

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [23]:
# 5가지 값이 나오는 이유 : 인덱스를 직접 지정, 같은 인덱스끼리 연산
result = pop-pop1
result

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [25]:
# 값이 없는 것들을 걸러내기 : notnull() 값이 없는것 notnull
result.notnull()
result[result.notnull()]

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [26]:
# 값이 있는 것들을 걸러내기 : isnull()
result[result.isnull()]

대구   NaN
대전   NaN
dtype: float64

In [29]:
# Series 데이터 갱신, 추가, 삭제
# 데이터 갱신 : 기존의 위치에 새로운 데이터를 대입
pop['대구'] = 2001234
pop

서울    9904312
부산    3448737
인천    2890451
대구    2001234
dtype: int64

In [30]:
# 데이터 삭제 : del
# del 삭제할 데이터
del pop['대구']
pop

서울    9904312
부산    3448737
인천    2890451
dtype: int64

In [31]:
# 데이터 추가 : 새로운 위치에 새로운 데이터를 대입
pop['광주'] = 1500000
pop

서울    9904312
부산    3448737
인천    2890451
광주    1500000
dtype: int64

In [ ]:
# DataFame : pandas 안에 있는 자료구조, 2차원
# 보기 편하다

In [25]:
# key값 : 컬럼이름
# values : value
# 딕셔너리는 컬럼방향으로 들어간다
data = {
    "2015" : [9904312,3448737,2890451,2466052],
    "2010" : [9631482,3393191,2632035,2431774]
}

df = pd.DataFrame(data)
df

      2015     2010
0  9904312  9631482
1  3448737  3393191
2  2890451  2632035
3  2466052  2431774

In [26]:
import pandas as pd
# 인덱스 수정
#df.index = ['서울', '부산', '인천', '대구']
#df
df
# 2015년의 인구수가 250만 이상인 도시의 전체 데이터 출력
bol = (df['2015'] >= 2500000)
df[bol]

      2015     2010
0  9904312  9631482
1  3448737  3393191
2  2890451  2632035

In [24]:
# 2015년의 인구수가 250만 이상인 도시의 전체 데이터 출력
# loc[인덱스, 컬럼]

df.loc[df.loc[:, '2015'] >= 2500000]

      2015
0  9904312
1  3448737
2  2890451

In [29]:
# DataFrame을 list로 만들기
# 하나의 리스트는 인덱스로 들어간다
data = [[9904312,3448737,2890451,2466052],[9361482,3393191,2632035,243174]]
ind = ['2015', '2010']
col = ['서울', '부산', '인천', '대구']
       

df2 = pd.DataFrame(data, index = ind, columns = col)
df2

           서울       부산       인천       대구
2015  9904312  3448737  2890451  2466052
2010  9361482  3393191  2632035   243174

In [38]:
# DataFrame 값 확인 : values
df2.values

array([[9904312, 3448737, 2890451, 2466052],
       [9361482, 3393191, 2632035,  243174]], dtype=int64)

In [40]:
# DataFrame 인덱스 확인
df2.index

Index(['2015', '2010'], dtype='object')

In [41]:
# DataFrame 컬럼 확인 : columns
df2.columns

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [42]:
# DataFrame 값 , 수정 삭제 추가
df2

           서울       부산       인천       대구
2015  9904312  3448737  2890451  2466052
2010  9361482  3393191  2632035   243174

In [44]:
# df 값 수정하기
# 수정 :  기존 위치에 새로운 값 대입
# df 에서는 기존 인덱싱은 무조건 컬럼
df2['서울'] = [9900000,9300000]
df2

           서울       부산       인천       대구
2015  9900000  3448737  2890451  2466052
2010  9300000  3393191  2632035   243174

In [45]:
df2['광주'] = [1600000,1500000]
df2

           서울       부산       인천       대구       광주
2015  9900000  3448737  2890451  2466052  1600000
2010  9300000  3393191  2632035   243174  1500000

In [46]:
# df 값 삭제: del, drop()

del df2 ['광주']
df2

           서울       부산       인천       대구
2015  9900000  3448737  2890451  2466052
2010  9300000  3393191  2632035   243174

In [57]:
df2['광주'] = [1600000,1500000]
df2

           서울       부산       인천       대구       광주
2015  9900000  3448737  2890451  2466052  1600000
2010  9300000  3393191  2632035   243174  1500000

In [48]:
# df2.drop('광주', axis = 1)

           서울       부산       인천       대구
2015  9900000  3448737  2890451  2466052
2010  9300000  3393191  2632035   243174

In [58]:
# drop() : 컬럼 기준으로 삭제(axis = 1), 인덱스 기준으로 삭제(axis = 0)
# df2 = df2.drop('광주', axis = 1) # 삭제 후 출력
# df2
df2.drop('광주', axis = 1, inplace = True) # 삭제 후 저장
df2

           서울       부산       인천       대구
2015  9900000  3448737  2890451  2466052
2010  9300000  3393191  2632035   243174

In [36]:
# df 인덱싱, 슬라이싱 하기
# 인덱서 : 컬럼과 인덱스를 기준으로 인덱싱 / 슬라이싱하는 방법
# loc, iloc 인덱서가 존재
# loc[인덱스, 컬럼]
# iloc

df2.loc['2015', '서울' : '부산']

서울    9904312
부산    3448737
Name: 2015, dtype: int64

In [32]:
# 2005 컬럼 추가하기

df['2005']= [9762546,3512547,2517680,2456016]
df.index = ['서울', '부산', '인천', '대구']

In [33]:
# 광주 인덱스 추가하기
df.loc['광주'] = [1564813,1547812,1517680]
df

       2015     2010     2005
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680
대구  2466052  2431774  2456016
광주  1564813  1547812  1517680

In [91]:
# 하나의 대상의 값 바꾸기
# 바꿀위치 지정 = 새로운 값
# df.loc['광주','2005']=1
# df

In [ ]:
# 정렬
# 인덱스를 기준으로 정렬: sort_index()
# 데이터를 기준으로 정렬: sort_values()

In [34]:
# 한글 > 가나다순, 숫자 > 작은수 ~ 큰수
df = df.sort_index() # 변한 값이 출력되는 함수는 저장이 되지는 않는다
df

       2015     2010     2005
광주  1564813  1547812  1517680
대구  2466052  2431774  2456016
부산  3448737  3393191  3512547
서울  9904312  9631482  9762546
인천  2890451  2632035  2517680

In [35]:
# by = 대상이 되는 컬럼 or 인덱스
# axis = 0 : 컬럼, 1 : 인덱스
# 인덱스를 기준으로 정렬 > 컬럼이 하나의 단위로 움직임
# 컬럼을 기준으로 정렬 > 인덱스가 하나의 단위로 움직임
# ascending = True 오름차순 123 가나다 abc
# ascending = False 내림차순 321 다나가 cba
df.sort_values(by = '대구', axis = 1, ascending = False)

       2015     2005     2010
광주  1564813  1517680  1547812
대구  2466052  2456016  2431774
부산  3448737  3512547  3393191
서울  9904312  9762546  9631482
인천  2890451  2517680  2632035